app/forms/forgot_pass_form.rb

  def forgotPassword
    unless valid?
      @@isValidationEnabled = true
      return false
    end

    @@isValidationEnabled = false
    user = User.find_by(email: self.email)
    if user
      new_password = SecureRandom.alphanumeric(10)

      user.update(password: new_password)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'superAdmin@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`password_digest` = '$2a$12$99YLamMLcG45pUOiuk.5xebB11O2uixHfR4yfFGp/EyXrRM7EGMpi', `users`.`updated_at` = '2025-11-11 01:55:07.742223' WHERE `users`.`id` = 1