app/forms/login_form.rb

  def login
    unless valid?
      @@is_validation_enabled = true
      return false
    end

    @@is_validation_enabled = false
    user = UserService.find_user_by_email_and_not_in_role(
      self.email,
      Rails.configuration.const['role'][:member]
    )
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'superAdmin@gmail.com' LIMIT 1