app/helpers/users_helper.rb

  def paginated_users(page: 1, per_page: 10, search: nil)
    user = User.order(:id)
    user = user.where("name LIKE ? OR email LIKE ?", "%#{search}%", "%#{search}%") if search.present?
    if current_user.role == Rails.configuration.const['role'][:admin]
      user = user.where(created_by_id: current_user.id).where(role: Rails.configuration.const['role'][:member])
    end

    user.page(page).per(per_page)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 53 LIMIT 1

  def destroy_user(id)
    user = User.find_by(id: params[:id])
    unless user
      return false
    end

    role = Rails.configuration.const['role']
    if user.role == role[:admin]
      user_children = User.where(created_by_id: user.id).where(role: role[:member])
      user_children.destroy_all if user_children.count > 1
---
SELECT `users`.* FROM `users` WHERE `users`.`created_by_id` = 4 AND `users`.`role` = 3
SELECT COUNT(*) FROM `users` WHERE `users`.`created_by_id` = 33 AND `users`.`role` = 3
DELETE FROM `users` WHERE `users`.`id` = 53