app/controllers/users_controller.rb

  def destroy
    result = @user_service.destroy_user(params[:id])
---
DELETE FROM `users` WHERE `users`.`id` = 53

  def set_roles_and_teams
    constants = Rails.configuration.const

    @roles_values = constants['role_value'].dup
    @roles_values.delete(1)
    @role_value_options = @roles_values.map { |key, value| [value, key] }
    @roles = constants['role']

    @teams = Team.all
---
SELECT `teams`.* FROM `teams`